MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC30F6014A/mcu.h
extern volatile C2RXM0EIDHBITS C2RXM0EIDHbits __attribute__((__sfr__));

#define C2RXM0EIDL C2RXM0EIDL
extern volatile uint16_t C2RXM0EIDL __attribute__((__sfr__));
__extension__ typedef struct tagC2RXM0EIDLBITS {
  union {
    struct {
      uint16_t :10;
      uint16_t EID0:1;
      uint16_t EID1:1;
      uint16_t EID2:1;
      uint16_t EID3:1;
      uint16_t EID4:1;
      uint16_t EID5:1;
    };
    struct {
      uint16_t :10;
      uint16_t EID5_0:6;
    };
  };
} C2RXM0EIDLBITS;
extern volatile C2RXM0EIDLBITS C2RXM0EIDLbits __attribute__((__sfr__));

#define C2RXM1SID C2RXM1SID
extern volatile uint16_t C2RXM1SID __attribute__((__sfr__));
__extension__ typedef struct tagC2RXM1SIDBITS {
  union {
    struct {
      uint16_t MIDE:1;
      uint16_t :1;
      uint16_t SID0:1;
      uint16_t SID1:1;
      uint16_t SID2:1;
      uint16_t SID3:1;
      uint16_t SID4:1;
      uint16_t SID5:1;
      uint16_t SID6:1;
      uint16_t SID7:1;
      uint16_t SID8:1;
      uint16_t SID9:1;
      uint16_t SID10:1;
    };
    struct {
      uint16_t :2;
      uint16_t SID:11;
    };
  };
} C2RXM1SIDBITS;
extern volatile C2RXM1SIDBITS C2RXM1SIDbits __attribute__((__sfr__));

#define C2RXM1EIDH C2RXM1EIDH
extern volatile uint16_t C2RXM1EIDH __attribute__((__sfr__));
typedef struct tagC2RXM1EIDHBITS {
  uint16_t EID6:1;
  uint16_t EID7:1;
  uint16_t EID8:1;
  uint16_t EID9:1;
  uint16_t EID10:1;
  uint16_t EID11:1;
  uint16_t EID12:1;
  uint16_t EID13:1;
  uint16_t EID14:1;
  uint16_t EID15:1;
  uint16_t EID16:1;
  uint16_t EID17:1;
} C2RXM1EIDHBITS;
extern volatile C2RXM1EIDHBITS C2RXM1EIDHbits __attribute__((__sfr__));

#define C2RXM1EIDL C2RXM1EIDL
extern volatile uint16_t C2RXM1EIDL __attribute__((__sfr__));
__extension__ typedef struct tagC2RXM1EIDLBITS {
  union {
    struct {
      uint16_t :10;
      uint16_t EID0:1;
      uint16_t EID1:1;
      uint16_t EID2:1;
      uint16_t EID3:1;
      uint16_t EID4:1;
      uint16_t EID5:1;
    };
    struct {
      uint16_t :10;
      uint16_t EID5_0:6;
    };
  };
} C2RXM1EIDLBITS;
extern volatile C2RXM1EIDLBITS C2RXM1EIDLbits __attribute__((__sfr__));

#define C2TX2SID C2TX2SID
extern volatile uint16_t C2TX2SID __attribute__((__sfr__));
__extension__ typedef struct tagC2TX2SIDBITS {
  union {
    struct {
      uint16_t TXIDE:1;
      uint16_t SRR:1;
      uint16_t SID0:1;
      uint16_t SID1:1;
      uint16_t SID2:1;
      uint16_t SID3:1;
      uint16_t SID4:1;
      uint16_t SID5:1;
      uint16_t :3;
      uint16_t SID6:1;
      uint16_t SID7:1;
      uint16_t SID8:1;
      uint16_t SID9:1;
      uint16_t SID10:1;
    };
    struct {
      uint16_t :2;
      uint16_t SID5_0:6;
      uint16_t :3;
      uint16_t SID10_6:5;
    };
  };
} C2TX2SIDBITS;
extern volatile C2TX2SIDBITS C2TX2SIDbits __attribute__((__sfr__));

#define C2TX2EID C2TX2EID
extern volatile uint16_t C2TX2EID __attribute__((__sfr__));
__extension__ typedef struct tagC2TX2EIDBITS {
  union {
    struct {
      uint16_t EID6:1;
      uint16_t EID7:1;
      uint16_t EID8:1;
      uint16_t EID9:1;
      uint16_t EID10:1;
      uint16_t EID11:1;
      uint16_t EID12:1;
      uint16_t EID13:1;
      uint16_t :4;
      uint16_t EID14:1;
      uint16_t EID15:1;
      uint16_t EID16:1;
      uint16_t EID17:1;
    };
    struct {
      uint16_t EID13_6:8;
      uint16_t :4;
      uint16_t EID17_14:4;
    };
  };
} C2TX2EIDBITS;
extern volatile C2TX2EIDBITS C2TX2EIDbits __attribute__((__sfr__));

#define C2TX2DLC C2TX2DLC
extern volatile uint16_t C2TX2DLC __attribute__((__sfr__));
__extension__ typedef struct tagC2TX2DLCBITS {
  union {
    struct {
      uint16_t :3;
      uint16_t DLC:4;
      uint16_t TXRB0:1;
      uint16_t TXRB1:1;
      uint16_t TXRTR:1;
      uint16_t EID0:1;
      uint16_t EID1:1;
      uint16_t EID2:1;
      uint16_t EID3:1;
      uint16_t EID4:1;
      uint16_t EID5:1;
    };
    struct {
      uint16_t :10;
      uint16_t EID5_0:6;
    };
    struct {
      uint16_t :3;
      uint16_t DLC0:1;
      uint16_t DLC1:1;
      uint16_t DLC2:1;
      uint16_t DLC3:1;
    };
  };
} C2TX2DLCBITS;
extern volatile C2TX2DLCBITS C2TX2DLCbits __attribute__((__sfr__));

#define C2TX2B1 C2TX2B1
extern volatile uint16_t C2TX2B1 __attribute__((__sfr__));
typedef struct tagC2TX2B1BITS {
  uint16_t TXB2D00:1;
  uint16_t TXB2D01:1;
  uint16_t TXB2D02:1;
  uint16_t TXB2D03:1;
  uint16_t TXB2D04:1;
  uint16_t TXB2D05:1;
  uint16_t TXB2D06:1;
  uint16_t TXB2D07:1;
  uint16_t TXB2D10:1;
  uint16_t TXB2D11:1;
  uint16_t TXB2D12:1;
  uint16_t TXB2D13:1;
  uint16_t TXB2D14:1;
  uint16_t TXB2D15:1;
  uint16_t TXB2D16:1;
  uint16_t TXB2D17:1;
} C2TX2B1BITS;
extern volatile C2TX2B1BITS C2TX2B1bits __attribute__((__sfr__));

#define C2TX2B2 C2TX2B2
extern volatile uint16_t C2TX2B2 __attribute__((__sfr__));
typedef struct tagC2TX2B2BITS {
  uint16_t TXB2D20:1;
  uint16_t TXB2D21:1;
  uint16_t TXB2D22:1;
  uint16_t TXB2D23:1;
  uint16_t TXB2D24:1;
  uint16_t TXB2D25:1;
  uint16_t TXB2D26:1;
  uint16_t TXB2D27:1;
  uint16_t TXB2D30:1;
  uint16_t TXB2D31:1;
  uint16_t TXB2D32:1;
  uint16_t TXB2D33:1;
  uint16_t TXB2D34:1;
  uint16_t TXB2D35:1;
  uint16_t TXB2D36:1;
  uint16_t TXB2D37:1;
} C2TX2B2BITS;
extern volatile C2TX2B2BITS C2TX2B2bits __attribute__((__sfr__));

#define C2TX2B3 C2TX2B3
extern volatile uint16_t C2TX2B3 __attribute__((__sfr__));
typedef struct tagC2TX2B3BITS {
  uint16_t TXB2D40:1;
  uint16_t TXB2D41:1;
  uint16_t TXB2D42:1;
  uint16_t TXB2D43:1;
  uint16_t TXB2D44:1;
  uint16_t TXB2D45:1;
  uint16_t TXB2D46:1;
  uint16_t TXB2D47:1;
  uint16_t TXB2D50:1;
  uint16_t TXB2D51:1;
  uint16_t TXB2D52:1;
  uint16_t TXB2D53:1;
  uint16_t TXB2D54:1;
  uint16_t TXB2D55:1;
  uint16_t TXB2D56:1;
  uint16_t TXB2D57:1;
} C2TX2B3BITS;
extern volatile C2TX2B3BITS C2TX2B3bits __attribute__((__sfr__));

#define C2TX2B4 C2TX2B4
extern volatile uint16_t C2TX2B4 __attribute__((__sfr__));
typedef struct tagC2TX2B4BITS {
  uint16_t TXB2D60:1;
  uint16_t TXB2D61:1;
  uint16_t TXB2D62:1;
  uint16_t TXB2D63:1;
  uint16_t TXB2D64:1;
  uint16_t TXB2D65:1;
  uint16_t TXB2D66:1;
  uint16_t TXB2D67:1;
  uint16_t TXB2D70:1;
  uint16_t TXB2D71:1;
  uint16_t TXB2D72:1;
  uint16_t TXB2D73:1;
  uint16_t TXB2D74:1;
  uint16_t TXB2D75:1;
  uint16_t TXB2D76:1;
  uint16_t TXB2D77:1;
} C2TX2B4BITS;
extern volatile C2TX2B4BITS C2TX2B4bits __attribute__((__sfr__));

#define C2TX2CON C2TX2CON
extern volatile uint16_t C2TX2CON __attribute__((__sfr__));
__extension__ typedef struct tagC2TX2CONBITS {
  union {
    struct {
      uint16_t TXPRI:2;
      uint16_t :1;
      uint16_t TXREQ:1;
      uint16_t TXERR:1;
      uint16_t TXLARB:1;
      uint16_t TXABT:1;
    };
    struct {
      uint16_t TXPRI0:1;
      uint16_t TXPRI1:1;
    };
  };
} C2TX2CONBITS;
extern volatile C2TX2CONBITS C2TX2CONbits __attribute__((__sfr__));

#define C2TX1SID C2TX1SID
extern volatile uint16_t C2TX1SID __attribute__((__sfr__));
__extension__ typedef struct tagC2TX1SIDBITS {
  union {
    struct {
      uint16_t TXIDE:1;
      uint16_t SRR:1;
      uint16_t SID0:1;
      uint16_t SID1:1;
      uint16_t SID2:1;
      uint16_t SID3:1;
      uint16_t SID4:1;
      uint16_t SID5:1;
      uint16_t :3;
      uint16_t SID6:1;
      uint16_t SID7:1;
      uint16_t SID8:1;
      uint16_t SID9:1;
      uint16_t SID10:1;
    };
    struct {
      uint16_t :2;
      uint16_t SID5_0:6;
      uint16_t :3;
      uint16_t SID10_6:5;
    };
  };
} C2TX1SIDBITS;
