MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC30F6014A/mcu.h
#define _C2RX1B3_TXB1D53_POSITION                0x0000000B
#define _C2RX1B3_TXB1D53_MASK                    0x00000800
#define _C2RX1B3_TXB1D53_LENGTH                  0x00000001

#define _C2RX1B3_TXB1D54_POSITION                0x0000000C
#define _C2RX1B3_TXB1D54_MASK                    0x00001000
#define _C2RX1B3_TXB1D54_LENGTH                  0x00000001

#define _C2RX1B3_TXB1D55_POSITION                0x0000000D
#define _C2RX1B3_TXB1D55_MASK                    0x00002000
#define _C2RX1B3_TXB1D55_LENGTH                  0x00000001

#define _C2RX1B3_TXB1D56_POSITION                0x0000000E
#define _C2RX1B3_TXB1D56_MASK                    0x00004000
#define _C2RX1B3_TXB1D56_LENGTH                  0x00000001

#define _C2RX1B3_TXB1D57_POSITION                0x0000000F
#define _C2RX1B3_TXB1D57_MASK                    0x00008000
#define _C2RX1B3_TXB1D57_LENGTH                  0x00000001

#define _C2RX1B4_TXB1D60_POSITION                0x00000000
#define _C2RX1B4_TXB1D60_MASK                    0x00000001
#define _C2RX1B4_TXB1D60_LENGTH                  0x00000001

#define _C2RX1B4_TXB1D61_POSITION                0x00000001
#define _C2RX1B4_TXB1D61_MASK                    0x00000002
#define _C2RX1B4_TXB1D61_LENGTH                  0x00000001

#define _C2RX1B4_TXB1D62_POSITION                0x00000002
#define _C2RX1B4_TXB1D62_MASK                    0x00000004
#define _C2RX1B4_TXB1D62_LENGTH                  0x00000001

#define _C2RX1B4_TXB1D63_POSITION                0x00000003
#define _C2RX1B4_TXB1D63_MASK                    0x00000008
#define _C2RX1B4_TXB1D63_LENGTH                  0x00000001

#define _C2RX1B4_TXB1D64_POSITION                0x00000004
#define _C2RX1B4_TXB1D64_MASK                    0x00000010
#define _C2RX1B4_TXB1D64_LENGTH                  0x00000001

#define _C2RX1B4_TXB1D65_POSITION                0x00000005
#define _C2RX1B4_TXB1D65_MASK                    0x00000020
#define _C2RX1B4_TXB1D65_LENGTH                  0x00000001

#define _C2RX1B4_TXB1D66_POSITION                0x00000006
#define _C2RX1B4_TXB1D66_MASK                    0x00000040
#define _C2RX1B4_TXB1D66_LENGTH                  0x00000001

#define _C2RX1B4_TXB1D67_POSITION                0x00000007
#define _C2RX1B4_TXB1D67_MASK                    0x00000080
#define _C2RX1B4_TXB1D67_LENGTH                  0x00000001

#define _C2RX1B4_TXB1D70_POSITION                0x00000008
#define _C2RX1B4_TXB1D70_MASK                    0x00000100
#define _C2RX1B4_TXB1D70_LENGTH                  0x00000001

#define _C2RX1B4_TXB1D71_POSITION                0x00000009
#define _C2RX1B4_TXB1D71_MASK                    0x00000200
#define _C2RX1B4_TXB1D71_LENGTH                  0x00000001

#define _C2RX1B4_TXB1D72_POSITION                0x0000000A
#define _C2RX1B4_TXB1D72_MASK                    0x00000400
#define _C2RX1B4_TXB1D72_LENGTH                  0x00000001

#define _C2RX1B4_TXB1D73_POSITION                0x0000000B
#define _C2RX1B4_TXB1D73_MASK                    0x00000800
#define _C2RX1B4_TXB1D73_LENGTH                  0x00000001

#define _C2RX1B4_TXB1D74_POSITION                0x0000000C
#define _C2RX1B4_TXB1D74_MASK                    0x00001000
#define _C2RX1B4_TXB1D74_LENGTH                  0x00000001

#define _C2RX1B4_TXB1D75_POSITION                0x0000000D
#define _C2RX1B4_TXB1D75_MASK                    0x00002000
#define _C2RX1B4_TXB1D75_LENGTH                  0x00000001

#define _C2RX1B4_TXB1D76_POSITION                0x0000000E
#define _C2RX1B4_TXB1D76_MASK                    0x00004000
#define _C2RX1B4_TXB1D76_LENGTH                  0x00000001

#define _C2RX1B4_TXB1D77_POSITION                0x0000000F
#define _C2RX1B4_TXB1D77_MASK                    0x00008000
#define _C2RX1B4_TXB1D77_LENGTH                  0x00000001

#define _C2RX1CON_FILHIT_POSITION                0x00000000
#define _C2RX1CON_FILHIT_MASK                    0x00000007
#define _C2RX1CON_FILHIT_LENGTH                  0x00000003

#define _C2RX1CON_RXRTRRO_POSITION               0x00000003
#define _C2RX1CON_RXRTRRO_MASK                   0x00000008
#define _C2RX1CON_RXRTRRO_LENGTH                 0x00000001

#define _C2RX1CON_RXFUL_POSITION                 0x00000007
#define _C2RX1CON_RXFUL_MASK                     0x00000080
#define _C2RX1CON_RXFUL_LENGTH                   0x00000001

#define _C2RX1CON_FILHIT0_POSITION               0x00000000
#define _C2RX1CON_FILHIT0_MASK                   0x00000001
#define _C2RX1CON_FILHIT0_LENGTH                 0x00000001

#define _C2RX1CON_FILHIT1_POSITION               0x00000001
#define _C2RX1CON_FILHIT1_MASK                   0x00000002
#define _C2RX1CON_FILHIT1_LENGTH                 0x00000001

#define _C2RX1CON_FILHIT2_POSITION               0x00000002
#define _C2RX1CON_FILHIT2_MASK                   0x00000004
#define _C2RX1CON_FILHIT2_LENGTH                 0x00000001

#define _C2RX0SID_RXIDE_POSITION                 0x00000000
#define _C2RX0SID_RXIDE_MASK                     0x00000001
#define _C2RX0SID_RXIDE_LENGTH                   0x00000001

#define _C2RX0SID_SRR_POSITION                   0x00000001
#define _C2RX0SID_SRR_MASK                       0x00000002
#define _C2RX0SID_SRR_LENGTH                     0x00000001

#define _C2RX0SID_SID0_POSITION                  0x00000002
#define _C2RX0SID_SID0_MASK                      0x00000004
#define _C2RX0SID_SID0_LENGTH                    0x00000001

#define _C2RX0SID_SID1_POSITION                  0x00000003
#define _C2RX0SID_SID1_MASK                      0x00000008
#define _C2RX0SID_SID1_LENGTH                    0x00000001

#define _C2RX0SID_SID2_POSITION                  0x00000004
#define _C2RX0SID_SID2_MASK                      0x00000010
#define _C2RX0SID_SID2_LENGTH                    0x00000001

#define _C2RX0SID_SID3_POSITION                  0x00000005
#define _C2RX0SID_SID3_MASK                      0x00000020
#define _C2RX0SID_SID3_LENGTH                    0x00000001

#define _C2RX0SID_SID4_POSITION                  0x00000006
#define _C2RX0SID_SID4_MASK                      0x00000040
#define _C2RX0SID_SID4_LENGTH                    0x00000001

#define _C2RX0SID_SID5_POSITION                  0x00000007
#define _C2RX0SID_SID5_MASK                      0x00000080
#define _C2RX0SID_SID5_LENGTH                    0x00000001

#define _C2RX0SID_SID6_POSITION                  0x00000008
#define _C2RX0SID_SID6_MASK                      0x00000100
#define _C2RX0SID_SID6_LENGTH                    0x00000001

#define _C2RX0SID_SID7_POSITION                  0x00000009
#define _C2RX0SID_SID7_MASK                      0x00000200
#define _C2RX0SID_SID7_LENGTH                    0x00000001

#define _C2RX0SID_SID8_POSITION                  0x0000000A
#define _C2RX0SID_SID8_MASK                      0x00000400
#define _C2RX0SID_SID8_LENGTH                    0x00000001

#define _C2RX0SID_SID9_POSITION                  0x0000000B
#define _C2RX0SID_SID9_MASK                      0x00000800
#define _C2RX0SID_SID9_LENGTH                    0x00000001

