MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC30F6014A/mcu.h
#define _C2INTF_WAKIF_POSITION                   0x00000006
#define _C2INTF_WAKIF_MASK                       0x00000040
#define _C2INTF_WAKIF_LENGTH                     0x00000001

#define _C2INTF_IRXIF_POSITION                   0x00000007
#define _C2INTF_IRXIF_MASK                       0x00000080
#define _C2INTF_IRXIF_LENGTH                     0x00000001

#define _C2INTF_EWARN_POSITION                   0x00000008
#define _C2INTF_EWARN_MASK                       0x00000100
#define _C2INTF_EWARN_LENGTH                     0x00000001

#define _C2INTF_RXWARN_POSITION                  0x00000009
#define _C2INTF_RXWARN_MASK                      0x00000200
#define _C2INTF_RXWARN_LENGTH                    0x00000001

#define _C2INTF_TXWARN_POSITION                  0x0000000A
#define _C2INTF_TXWARN_MASK                      0x00000400
#define _C2INTF_TXWARN_LENGTH                    0x00000001

#define _C2INTF_RXBP_POSITION                    0x0000000B
#define _C2INTF_RXBP_MASK                        0x00000800
#define _C2INTF_RXBP_LENGTH                      0x00000001

#define _C2INTF_TXBP_POSITION                    0x0000000C
#define _C2INTF_TXBP_MASK                        0x00001000
#define _C2INTF_TXBP_LENGTH                      0x00000001

#define _C2INTF_TXBO_POSITION                    0x0000000D
#define _C2INTF_TXBO_MASK                        0x00002000
#define _C2INTF_TXBO_LENGTH                      0x00000001

#define _C2INTF_RXB1OVFL_POSITION                0x0000000E
#define _C2INTF_RXB1OVFL_MASK                    0x00004000
#define _C2INTF_RXB1OVFL_LENGTH                  0x00000001

#define _C2INTF_RXB0OVFL_POSITION                0x0000000F
#define _C2INTF_RXB0OVFL_MASK                    0x00008000
#define _C2INTF_RXB0OVFL_LENGTH                  0x00000001

#define _C2INTF_RX0IF_POSITION                   0x00000000
#define _C2INTF_RX0IF_MASK                       0x00000001
#define _C2INTF_RX0IF_LENGTH                     0x00000001

#define _C2INTF_RX1IF_POSITION                   0x00000001
#define _C2INTF_RX1IF_MASK                       0x00000002
#define _C2INTF_RX1IF_LENGTH                     0x00000001

#define _C2INTF_TX0IF_POSITION                   0x00000002
#define _C2INTF_TX0IF_MASK                       0x00000004
#define _C2INTF_TX0IF_LENGTH                     0x00000001

#define _C2INTF_TX1IF_POSITION                   0x00000003
#define _C2INTF_TX1IF_MASK                       0x00000008
#define _C2INTF_TX1IF_LENGTH                     0x00000001

#define _C2INTF_TX2IF_POSITION                   0x00000004
#define _C2INTF_TX2IF_MASK                       0x00000010
#define _C2INTF_TX2IF_LENGTH                     0x00000001

#define _C2INTF_IVRIF_POSITION                   0x00000007
#define _C2INTF_IVRIF_MASK                       0x00000080
#define _C2INTF_IVRIF_LENGTH                     0x00000001

#define _C2INTF_RXWAR_POSITION                   0x00000009
#define _C2INTF_RXWAR_MASK                       0x00000200
#define _C2INTF_RXWAR_LENGTH                     0x00000001

#define _C2INTF_TXWAR_POSITION                   0x0000000A
#define _C2INTF_TXWAR_MASK                       0x00000400
#define _C2INTF_TXWAR_LENGTH                     0x00000001

#define _C2INTF_RXEP_POSITION                    0x0000000B
#define _C2INTF_RXEP_MASK                        0x00000800
#define _C2INTF_RXEP_LENGTH                      0x00000001

#define _C2INTF_TXEP_POSITION                    0x0000000C
#define _C2INTF_TXEP_MASK                        0x00001000
#define _C2INTF_TXEP_LENGTH                      0x00000001

#define _C2INTF_RX1OVR_POSITION                  0x0000000E
#define _C2INTF_RX1OVR_MASK                      0x00004000
#define _C2INTF_RX1OVR_LENGTH                    0x00000001

#define _C2INTF_RX0OVR_POSITION                  0x0000000F
#define _C2INTF_RX0OVR_MASK                      0x00008000
#define _C2INTF_RX0OVR_LENGTH                    0x00000001

#define _C2INTE_RXB0IE_POSITION                  0x00000000
#define _C2INTE_RXB0IE_MASK                      0x00000001
#define _C2INTE_RXB0IE_LENGTH                    0x00000001

#define _C2INTE_RXB1IE_POSITION                  0x00000001
#define _C2INTE_RXB1IE_MASK                      0x00000002
#define _C2INTE_RXB1IE_LENGTH                    0x00000001

#define _C2INTE_TXB0IE_POSITION                  0x00000002
#define _C2INTE_TXB0IE_MASK                      0x00000004
#define _C2INTE_TXB0IE_LENGTH                    0x00000001

#define _C2INTE_TXB1IE_POSITION                  0x00000003
#define _C2INTE_TXB1IE_MASK                      0x00000008
#define _C2INTE_TXB1IE_LENGTH                    0x00000001

#define _C2INTE_TXB2IE_POSITION                  0x00000004
#define _C2INTE_TXB2IE_MASK                      0x00000010
#define _C2INTE_TXB2IE_LENGTH                    0x00000001

#define _C2INTE_ERRIE_POSITION                   0x00000005
#define _C2INTE_ERRIE_MASK                       0x00000020
#define _C2INTE_ERRIE_LENGTH                     0x00000001

#define _C2INTE_WAKIE_POSITION                   0x00000006
#define _C2INTE_WAKIE_MASK                       0x00000040
#define _C2INTE_WAKIE_LENGTH                     0x00000001

#define _C2INTE_IRXIE_POSITION                   0x00000007
#define _C2INTE_IRXIE_MASK                       0x00000080
#define _C2INTE_IRXIE_LENGTH                     0x00000001

#define _C2INTE_RX0IE_POSITION                   0x00000000
#define _C2INTE_RX0IE_MASK                       0x00000001
#define _C2INTE_RX0IE_LENGTH                     0x00000001

#define _C2INTE_RX1IE_POSITION                   0x00000001
#define _C2INTE_RX1IE_MASK                       0x00000002
#define _C2INTE_RX1IE_LENGTH                     0x00000001

#define _C2INTE_TX0IE_POSITION                   0x00000002
#define _C2INTE_TX0IE_MASK                       0x00000004
#define _C2INTE_TX0IE_LENGTH                     0x00000001

#define _C2INTE_TX1IE_POSITION                   0x00000003
#define _C2INTE_TX1IE_MASK                       0x00000008
#define _C2INTE_TX1IE_LENGTH                     0x00000001

